# Pandas

In [1]:
# import the pandas library and aliasing with pd
import pandas as pd
import numpy as np

In [2]:
s = pd.Series()
print(s)

Series([], dtype: float64)

C:\Users\AneervanRay\Anaconda_3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

##### data series without index

In [3]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

##### data series with index

In [4]:
data = np.array((11.8,12,13,14))
s1 = pd.Series(data, index = [101,102,103,104])
print(s1)

101    11.8
102    12.0
103    13.0
104    14.0
dtype: float64

##### data series from dictionary

In [5]:
data = {'amit':22, 'Vipin':21, 'Kamal':55}
s = pd.Series(data)
print(s)

amit     22
Vipin    21
Kamal    55
dtype: int64

In [6]:
data = {'a':9.9, 'b':1.4, 'c':2.0, 'd':11, 'e':12}
s = pd.Series(data, index = ['b','a','e','d','c','k'])
print(s)

b     1.4
a     9.9
e    12.0
d    11.0
c     2.0
k     NaN
dtype: float64

In [9]:
s = pd.Series(7, index=[0,1,2,3])
print(s)

0    7
1    7
2    7
3    7
dtype: int64

#### Creating dataframe and deleting column

In [7]:
mydict = {'names': ['somu','Kiku','Amol','Lini'],
         'physics': [68,74,77,78],
         'chemistry': [84,56,73,69],
         'algebra': [78,88,82,87] }

s = pd.Series(mydict)
print(s)

names        [somu, Kiku, Amol, Lini]
physics              [68, 74, 77, 78]
chemistry            [84, 56, 73, 69]
algebra              [78, 88, 82, 87]
dtype: object

In [8]:
# Create Dataframe
df_marks = pd.DataFrame(mydict)
print('Original Dataframe\n-----------------------')
print(df_marks)

Original Dataframe
-----------------------
  names  physics  chemistry  algebra
0  somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87

In [9]:
print("------------After Pop-------------")
df1 = df_marks
# delete column
df1.pop("algebra")
print('\n\nDataFrame after deleting column\n-------------------')
print(df1)

------------After Pop-------------


DataFrame after deleting column
-------------------
  names  physics  chemistry
0  somu       68         84
1  Kiku       74         56
2  Amol       77         73
3  Lini       78         69

In [15]:
print("-----------last----------")
print(df_marks)

-----------last----------
  names  physics  chemistry
0  somu       68         84
1  Kiku       74         56
2  Amol       77         73
3  Lini       78         69

#### Creating dataframe and appending row

In [10]:
data = {'names': ['somu','Kiku','Amol','Lini'],
         'physics': [68,74,77,78],
         'chemistry': [84,56,73,69],
         'algebra': [78,88,82,87] }

In [11]:
# Create dataframe
df_marks = pd.DataFrame(data)
print('Original DataFrame\n-------------------')
print(df_marks)

Original DataFrame
-------------------
  names  physics  chemistry  algebra
0  somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87

In [24]:
new_row = {'names':'Amit', 'physics':87, 'chemistry':92, 
            'algebra':97}

In [25]:
# append row to the dataframe
df2 = df_marks.append(new_row, ignore_index = True)
print("\n\nNew row added to DataFrame\n-----------------")
print(df2)

New row added to DataFrame
-----------------
  names  physics  chemistry  algebra
0  somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87
4  Amit       87         92       97

### Loading Datasets and extracting data

In [12]:
import pandas as pd

In [26]:
data = pd.read_csv('Income_data.csv')
data

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,NaN,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418.0,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657.0,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057.0,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319.0,55734,57014,56134,54283,53367,57020,57528

In [25]:
data2 = data.set_index("State")
data2

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,NaN,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418.0,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657.0,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057.0,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319.0,55734,57014,56134,54283,53367,57020,57528

#### iloc [start row index:end row index, start column index:end column index]

In [29]:
data3 = data2.iloc[1:3, 2:4]
data3

            2006   2007
State
Alaska   56418.0  62993
Arizona  46657.0  47215

In [30]:
data4 = data2.iloc[:,2:4]
data4

               2006   2007
State
Alabama         NaN  42212
Alaska      56418.0  62993
Arizona     46657.0  47215
Arkansas    37057.0  40795
California  55319.0  55734

In [32]:
data5 = data2.iloc[:,2]
data5

State
Alabama           NaN
Alaska        56418.0
Arizona       46657.0
Arkansas      37057.0
California    55319.0
Name: 2006, dtype: float64

In [18]:
print("Average sales: ",data5.mean())

Average sales:  48862.75

In [27]:
# extracting particular columns
data6 = data2.iloc[:,[1,3,5]]
data6

             2005   2007   2009
State
Alabama     37150  42212  39980
Alaska      55891  62993  61604
Arizona     45245  47215  45739
Arkansas    36658  40795  36538
California  51755  55734  56134

In [33]:
# mean of data column wise
data61 = data6.mean(axis=0)
data61

2005    45339.8
2007    49789.8
2009    47999.0
dtype: float64

In [34]:
# mean of data row wise
data62 = data6.mean(axis=1)
data62

State
Alabama       39780.666667
Alaska        60162.666667
Arizona       46066.333333
Arkansas      37997.000000
California    54541.000000
dtype: float64

In [24]:
data2

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,NaN,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418.0,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657.0,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057.0,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319.0,55734,57014,56134,54283,53367,57020,57528

### loc[ ]

In [36]:
df1 = data2.loc["Alabama":"Arizona", "2007":"2009"]
df1

          2007   2008   2009
State
Alabama  42212  44476  39980
Alaska   62993  63989  61604
Arizona  47215  46914  45739

In [38]:
df2 = data2.loc["California",:]
df2

GEOID    04000US06
2005         51755
2006       55319.0
2007         55734
2008         57014
2009         56134
2010         54283
2011         53367
2012         57020
2013         57528
Name: California, dtype: object

In [39]:
df3 = data2.loc["California","2013"]
df3

57528

In [40]:
df4 = data2.mean()
df4

C:\Users\AneervanRay\Anaconda_3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

2005    45339.80
2006    48862.75
2007    49789.80
2008    50395.80
2009    47999.00
2010    47709.40
2011    48662.20
2012    50038.80
2013    50113.40
dtype: float64

In [42]:
df5 = data2.mean(axis=1)
df5

C:\Users\AneervanRay\Anaconda_3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

State
Alabama       41523.250000
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64